#include "includes.h"
#include "mainmenu.h"


u8 ALA_POINT[40][40]=			//布尔量为1的点表
{
{""},	
{"北斗卫星接收模块状态异常"},		//1  故障B7
{"GPS卫星接收模块状态异常"},		//2	 故障B6																						
{"北斗天线故障"},							//3  故障B5
{"GPS天线故障"},								//4  故障B4
{"CPU核心板状态异常"},				//5  故障B3
{"晶振驯服状态异常"},					//6  故障B2
{"所有独立时源均不可用"},		//7 故障B1																
{"所有独立时源均不可用"},		//8 故障B0

{""},												//9
{"电源模块1失电"},								//10 告警B7.1
{"电源模块2失电"},								//11 告警B7.2
{"北斗卫星失锁"},						//12 告警B6
{"GPS卫星失锁"},							//13 告警B5
{"IRIG-B码输入质量低于本机"},//14 告警B4

{"时间连续性异常"},					//15 告警B3(1+2+3+4)
{"时间连续性异常:北斗"},			//16 告警B3.1
{"时间连续性异常:GPS"},			//17 告警B3.2
{"时间连续性异常:IRIG-B1"},	//18 告警B3.3
{"时间连续性异常:IRIG-B2"},	//19 告警B3.4

{"任意一路时间源不可用"},			//20 告警B2(1+2+3+4)
{"时间源不可用:北斗"},				//21 告警B2.1			
{"时间源不可用:GPS"},				//22 告警B2.2			
{"时间源不可用:IRIG-B1"},		//23 告警B2.3	
{"时间源不可用:IRIG-B2"},		//24 告警B2.4
{""},												//25
{"所有独立时源均不可用"},		  //26 告警B1.1
{"所有独立时源均不可用"},		  //27 告警B0.1
{"时间源不可用:PTP1"},	      //28 告警B2.5	
{"时间源不可用:PTP2"},	      //29 告警B2.6
{"时间连续性异常:PTP1"},	    //30 告警B3.5	
{"时间连续性异常:PTP2"},	    //31 告警B3.6

};


//1:初始化,2错误, 3:关闭,4:监听,5:主模式预备,6:主模式,7:被动模式,8:未标定,9:从模式

u8 PTP_STA_CONST[10][10]=			
{
{"初始化    "},	
{"初始化    "},		
{"PTP故障   "},																					
{"PTP关闭   "},				
{"监听      "},							
{"主模式预备"},				
{"主模式    "},					
{"被动模式  "},												
{"未标定    "},		
{"从模式    "}								
};
//0主ETH/E2E；1主ETH-PTP;2主UDP-ETE;3主UDP-PTP:4从ETH/ETE；5从ETH-PTP;6从UDP-ETE;7从UDP-PTP8:NTP
u8 PTP_MODE_CONST[9][12]=			
{
{"ETH-E2E(主)"},	
{"ETH-P2P(主)"},		
{"UDP-E2E(主)"},																					
{"UDP-P2P(主)"},				
{"ETH-E2E(从)"},	
{"ETH-P2P(从)"},		
{"UDP-E2E(从)"},																					
{"UDP-P2P(从)"},	
{"NTP"},	
};


//u8 ALA_POINT[30][40]=			//布尔量为1的点表
//{
//{""},	
//{"北斗卫星接收模块状态异常"},		//1  故障B7
//{"GPS卫星接收模块状态异常"},		//2	 故障B6																						
//{"北斗天线故障"},							//3  故障B5
//{"GPS天线故障"},								//4  故障B4
//{"CPU核心板状态异常"},				//5  故障B3
//{"晶振驯服状态异常"},					//6  故障B2
//{"所有独立时源均不可用(首次同步,>30分钟)"},		//7 故障B1																
//{"所有独立时源均不可用(曾经同步,>24小时)"},		//8 故障B0

//{""},												//9
//{"电源模块1失电"},								//10 告警B7.1
//{"电源模块2失电"},								//11 告警B7.2
//{"北斗卫星失锁"},						//12 告警B6
//{"GPS卫星失锁"},							//13 告警B5
//{"IRIG-B码输入质量低于本机"},//14 告警B4

//{"时间连续性异常"},					//15 告警B3(1+2+3+4)
//{"时间连续性异常:北斗"},			//16 告警B3.1
//{"时间连续性异常:GPS"},			//17 告警B3.2
//{"时间连续性异常:IRIG-B1"},	//18 告警B3.3
//{"时间连续性异常:IRIG-B2"},	//19 告警B3.4

//{"任意一路时间源不可用"},			//20 告警B2(1+2+3+4)
//{"时间源不可用:北斗"},				//21 告警B2.1			
//{"时间源不可用:GPS"},				//22 告警B2.2			
//{"时间源不可用:IRIG-B1"},		//23 告警B2.3	
//{"时间源不可用:IRIG-B2"},		//24 告警B2.4
//{""},												//25
//{"所有独立时源均不可用(首次同步,<30分钟)"},		//26 告警B1.1
//{"所有独立时源均不可用(曾经同步,<24小时)"},		//27 告警B0.1

//};




u8 LOG_POINT[100][40]=			//布尔量为1的点表
{
{0},
{"北斗信号异常"},						//1
{"GPS信号异常"},							//2
{"IRIG-B1码输入信号异常"},					//3
{"IRIG-B2码输入信号异常"},					//4
{"PTP1源信号异常"},						//5
{"PTP2源信号异常"},						//6
{"北斗天线状态"},			//7
{"GPS天线状态"},				//8
{"北斗卫星接收模块状态异常"},			//9
{"GPS卫星接收模块状态异常"},				//10
{"时间跳变侦测状态异常"},		//11
{"北斗时间源跳变异常"},		//12
{"GPS时间源跳变异常"},		//13
{"IRIG-B1时间源跳变异常"},			//14
{"IRIG-B2时间源跳变异常"},			//15
{"PTP1时间源跳变异常"},			//16	
{"PTP2时间源跳变异常"},			//17
{"晶振驯服状态异常"},					//18
{"初始化状态异常"},						//19
{"电源模块状态异常"},					//20
{"电源模块1状态异常"},				//21
{"电源模块2状态异常"},				//22
{"IRIG-B码质量位低于本机"},				//23
{"所有独立时源均不可用 (首次同步,<30分钟)"},		//24
{"所有独立时源均不可用 (曾经同步,<24小时)"},		//25
{"其它装置告警"},			//26
{"CPU核心板状态异常"},					//27
{"晶振驯服状态异常"},					//28
{"所有独立时源均不可用 (首次同步,>30分钟)"},		//29
{"所有独立时源均不可用 (曾经同步,>24小时)"},		//30
{"其它装置故障"},		    	//31
{"闰秒预告"},							//32
{"北斗闰秒预告"},					//33
{"GPS闰秒预告"},						//34
{"B1闰秒预告"},				    //35	
{"B2闰秒预告"},				    //36
{"闰秒标志:负"},					  //37
{"时间源选择结果:"},		//38
{"备用1 "},								//39
{0},											//40
{0},											//41
{0},											//42
{0},											//43
{0},											//44
{0},											//45
{0},											//46
{0},											//47
{0},											//48
{0},											//49
{0},											//50
{0},											//51
{0},											//52
{0},											//53
{0},											//54
{0},											//55
{0},											//56
{0},											//57
{0},											//58
{0},											//59
{"用户登录"}, 					  	//60
{"装置同步状态异常"},			//61
{"装置插槽1状态:无板卡"},	//62
{0},											//63
{"装置插槽2状态:无板卡"},	//64
{0},											//65
{"装置插槽3状态:无板卡"},	//66
{0},											//67
{"装置插槽4状态:无板卡"},	//68
{0},											//69
{"装置插槽5状态:无板卡"},	//70
{0},											//71
{"装置插槽6状态:无板卡"},	//72
{0},											//73
{"装置插槽7状态:无板卡"},	//74
{0},											//75
{"装置插槽8状态:无板卡"},	//76
{0},											//77
{"装置插槽9状态:无板卡"},	//78
{0},											//79
{"装置插槽10状态:无板卡"},	//80
{0},											//81
{"装置插槽11状态:无板卡"},	//82
{0},											//83
{"装置插槽12状态:无板卡"},	//84
{0},											//85
{"装置插槽13状态:无板卡"},	//86
{0},											//87
{"装置插槽14状态:无板卡"},	//88
{0},											//89
{"北斗板卡插槽:无板卡"},		//90
{0},											//91
{"GPS板卡插槽:无板卡"},		//90
{0},											//93
{0},											//94
{0},											//95
{0},											//96
{0},											//97
{0},											//98
{0},											//99
};

u8 LOG_POINTRES[100][40]=		//布尔量为0的点表
{
{0},
{"北斗信号恢复"},						//1
{"GPS信号恢复"},							//2
{"IRIG-B1码输入信号恢复"},					//3
{"IRIG-B2码输入信号恢复"},					//4
{"PTP1源信号恢复"},						//5
{"PTP2源信号恢复"},						//6
{"北斗天线状态"},			//7
{"GPS天线状态"},				//8
{"北斗卫星接收模块状态恢复"},			//9
{"GPS卫星接收模块状态恢复"},				//10
{"时间跳变侦测状态恢复"},		//11
{"北斗时间源跳变恢复"},		//12
{"GPS时间源跳变恢复"},		//13
{"IRIG-B1时间源跳变恢复"},			//14
{"IRIG-B2时间源跳变恢复"},			//15
{"PTP1时间源跳变恢复"},			//16	
{"PTP2时间源跳变恢复"},			//17
{"晶振驯服状态恢复"},					//18
{"初始化状态异常恢复"},						//19
{"电源模块状态恢复"},					//20
{"电源模块1状态恢复"},				//21
{"电源模块2状态恢复"},				//22
{"IRIG-B码时间质量位恢复"},				//23
{"独立时源均不可用恢复"},					//24
{"独立时源均不可用恢复"},		//25
{"其它装置告警恢复"},			//26
{"CPU核心板状态恢复"},					//27
{"晶振驯服状态恢复"},					//28
{"独立时源均不可用恢复"},		//29
{"独立时源均不可用恢复"},		//30
{"其它装置故障恢复"},			//31
{"闰秒预告结束"},							//32
{"北斗闰秒预告结束"},						//33
{"GPS闰秒预告结束"},						//34
{"IRIG-B1闰秒预告结束"},				//35	
{"IRIG-B2闰秒预告结束"},				//36
{"闰秒标志:正"},					//37
{"时间源选择结果:"},					  //38
{"PTP1信号优先级:"},								//39
{"PTP2信号优先级:"},								//40
{"备用1 "},								//41
{"备用2 "},								//42
{"GPS信号优先级:"},					//43
{"北斗信号优先级:"},				//44
{"IRIG-B1信号优先级:"},			//45
{"IRIG-B2信号优先级:"},			//46
{0},//47
{0},	//48
{0},	//49
{0},	//50
{0},											//51
{0},											//52
{0},											//53
{0},											//54
{0},											//55
{0},											//56
{0},											//57
{0},											//58
{0},											//59
{"用户登录"}, 				    	//60
{"装置同步状态正常"},			//61
{"装置插槽1状态:有板卡"},	//62
{0},											//63
{"装置插槽2状态:有板卡"},	//64
{0},											//65
{"装置插槽3状态:有板卡"},	//66
{0},											//67
{"装置插槽4状态:有板卡"},	//68
{0},											//69
{"装置插槽5状态:有板卡"},	//70
{0},											//71
{"装置插槽6状态:有板卡"},	//72
{0},											//73
{"装置插槽7状态:有板卡"},	//74
{0},											//75
{"装置插槽8状态:有板卡"},	//76
{0},											//77
{"装置插槽9状态:有板卡"},	//78
{0},											//79
{"装置插槽10状态:有板卡"},	//80
{0},											//81
{"装置插槽11状态:有板卡"},	//82
{0},											//83
{"装置插槽12状态:有板卡"},	//84
{0},											//85
{"装置插槽13状态:有板卡"},	//86
{0},											//87
{"装置插槽14状态:有板卡"},	//88
{0},											//89
{"北斗板卡插槽:有板卡"},		//90
{0},											//91
{"GPS板卡插槽:有板卡"},		//90
{0},											//93
{0},											//94
{0},											//95
{0},											//96
{0},											//97
{0},											//98
{0},											//99
};
